#             __,
#          .-'_-'`
#        .' {`
#    .-'````'-.    .-'``'.
#  .'(0)       '._/ _.-.  `\
# }     '. ))    _<`    )`  |
#  `-.,\'.\_,.-\` \`---; .' /
#       )  )       '-.  '--:
#      ( ' (          ) '.  \
#       '.  )      .'(   /   )
#         )/      (   '.    /
#                  '._( ) .'
#                      ( (
#                       `-.
brew "fish"

# Ruby
brew "asdf"

# Databases
brew "redis", restart_service: :changed

# Utilities
brew "cmake"
brew "dokku"
brew "eza"
brew "gh"
brew "git"
brew "just"
brew "jq"
brew "openssl"
brew "ripgrep"
brew "trash"
brew "tree"
brew "wget"
